ahtn/keyplus/efm8/efm8/mcu/C8051F340/inc/SI_C8051F340_Register_Enums.h
#define SCON0_TI__BMASK             0x02 ///< Transmit Interrupt Flag                          
#define SCON0_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                          
#define SCON0_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART0.
#define SCON0_TI__SET               0x02 ///< UART0 transmitted a byte of data.                
                                                                                               
#define SCON0_RB8__BMASK            0x04 ///< Ninth Receive Bit                                
#define SCON0_RB8__SHIFT            0x02 ///< Ninth Receive Bit                                
#define SCON0_RB8__CLEARED_TO_0     0x00 ///< In Mode 0, the STOP bit was 0. In Mode 1, the 9th
                                         ///< bit was 0.                                       
#define SCON0_RB8__SET_TO_1         0x04 ///< In Mode 0, the STOP bit was 1. In Mode 1, the 9th
                                         ///< bit was 1.                                       
                                                                                               
#define SCON0_TB8__BMASK            0x08 ///< Ninth Transmission Bit                           
#define SCON0_TB8__SHIFT            0x03 ///< Ninth Transmission Bit                           
#define SCON0_TB8__CLEARED_TO_0     0x00 ///< In Mode 1, set the 9th transmission bit to 0.    
#define SCON0_TB8__SET_TO_1         0x08 ///< In Mode 1, set the 9th transmission bit to 1.    
                                                                                               
#define SCON0_REN__BMASK            0x10 ///< Receive Enable                                   
#define SCON0_REN__SHIFT            0x04 ///< Receive Enable                                   
#define SCON0_REN__RECEIVE_DISABLED 0x00 ///< UART0 reception disabled.                        
#define SCON0_REN__RECEIVE_ENABLED  0x10 ///< UART0 reception enabled.                         
                                                                                               
#define SCON0_MCE__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__MULTI_DISABLED   0x00 ///< Ignore level of 9th bit / Stop bit.              
#define SCON0_MCE__MULTI_ENABLED    0x20 ///< RI is set and an interrupt is generated only when
                                         ///< the stop bit is logic 1 (Mode 0) or when the 9th 
                                         ///< bit is logic 1 (Mode 1).                         
                                                                                               
#define SCON0_SMODE__BMASK          0x80 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__SHIFT          0x07 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__8_BIT          0x00 ///< 8-bit UART with Variable Baud Rate (Mode 0).     
#define SCON0_SMODE__9_BIT          0x80 ///< 9-bit UART with Variable Baud Rate (Mode 1).     
                                                                                               
//------------------------------------------------------------------------------
// SBCON1 Enums (UART1 Baud Rate Generator Control @ 0xAC)
//------------------------------------------------------------------------------
#define SBCON1_SBPS__FMASK     0x03 ///< Baud Rate Prescaler Select                     
#define SBCON1_SBPS__SHIFT     0x00 ///< Baud Rate Prescaler Select                     
#define SBCON1_SBPS__DIV_BY_12 0x00 ///< Prescaler = 12.                                
#define SBCON1_SBPS__DIV_BY_4  0x01 ///< Prescaler = 4.                                 
#define SBCON1_SBPS__DIV_BY_48 0x02 ///< Prescaler = 48.                                
#define SBCON1_SBPS__DIV_BY_1  0x03 ///< Prescaler = 1.                                 
                                                                                        
#define SBCON1_SBRUN__BMASK    0x40 ///< Baud Rate Generator Enable                     
#define SBCON1_SBRUN__SHIFT    0x06 ///< Baud Rate Generator Enable                     
#define SBCON1_SBRUN__DISABLED 0x00 ///< Disable the baud rate generator. UART1 will not
                                    ///< function.                                      
#define SBCON1_SBRUN__ENABLED  0x40 ///< Enable the baud rate generator.                
                                                                                        
//------------------------------------------------------------------------------
// SBRLH1 Enums (UART1 Baud Rate Generator High Byte @ 0xB5)
//------------------------------------------------------------------------------
#define SBRLH1_SBRL__FMASK 0xFF ///< UART1 Baud Rate Reload High
#define SBRLH1_SBRL__SHIFT 0x00 ///< UART1 Baud Rate Reload High
                                                                
//------------------------------------------------------------------------------
// SBRLL1 Enums (UART1 Baud Rate Generator Low Byte @ 0xB4)
//------------------------------------------------------------------------------
#define SBRLL1_SBRL__FMASK 0xFF ///< UART1 Baud Rate Reload Low
#define SBRLL1_SBRL__SHIFT 0x00 ///< UART1 Baud Rate Reload Low
                                                               
//------------------------------------------------------------------------------
// SBUF1 Enums (UART1 Serial Port Data Buffer @ 0xD3)
//------------------------------------------------------------------------------
#define SBUF1_SBUF1__FMASK 0xFF ///< Serial Port Data Buffer
#define SBUF1_SBUF1__SHIFT 0x00 ///< Serial Port Data Buffer
                                                            
//------------------------------------------------------------------------------
// SCON1 Enums (UART1 Serial Port Control @ 0xD2)
//------------------------------------------------------------------------------
#define SCON1_RI__BMASK             0x01 ///< Receive Interrupt Flag                            
#define SCON1_RI__SHIFT             0x00 ///< Receive Interrupt Flag                            
#define SCON1_RI__NOT_SET           0x00 ///< A byte of data has not been received by UART1.    
#define SCON1_RI__SET               0x01 ///< UART1 received a byte of data or data remains in  
                                         ///< the receive FIFO.                                 
                                                                                                
