ahtn/keyplus/efm8/efm8/mcu/C8051F340/inc/SI_C8051F340_Register_Enums.h
#define SCON1_TI__BMASK             0x02 ///< Transmit Interrupt Flag                           
#define SCON1_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                           
#define SCON1_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART1. 
#define SCON1_TI__SET               0x02 ///< UART1 transmitted a byte of data.                 
                                                                                                
#define SCON1_RBX__BMASK            0x04 ///< Extra Receive Bit                                 
#define SCON1_RBX__SHIFT            0x02 ///< Extra Receive Bit                                 
#define SCON1_RBX__LOW              0x00 ///< The extra bit or the first stop bit is 0.         
#define SCON1_RBX__HIGH             0x04 ///< The extra bit or the first stop bit is 1.         
                                                                                                
#define SCON1_TBX__BMASK            0x08 ///< Extra Transmission Bit                            
#define SCON1_TBX__SHIFT            0x03 ///< Extra Transmission Bit                            
#define SCON1_TBX__LOW              0x00 ///< Set extra bit to 0 (low).                         
#define SCON1_TBX__HIGH             0x08 ///< Set extra bit to 1 (high).                        
                                                                                                
#define SCON1_REN__BMASK            0x10 ///< Receive Enable                                    
#define SCON1_REN__SHIFT            0x04 ///< Receive Enable                                    
#define SCON1_REN__RECEIVE_DISABLED 0x00 ///< UART1 reception disabled.                         
#define SCON1_REN__RECEIVE_ENABLED  0x10 ///< UART1 reception enabled.                          
                                                                                                
#define SCON1_THRE__BMASK           0x20 ///< Transmit Holding Register Empty Flag              
#define SCON1_THRE__SHIFT           0x05 ///< Transmit Holding Register Empty Flag              
#define SCON1_THRE__NOT_SET         0x00 ///< The transmit holding register is not empty. Do not
                                         ///< write to SBUF1.                                   
#define SCON1_THRE__SET             0x20 ///< The transmit holding register is empty. It is safe
                                         ///< to write to SBUF1.                                
                                                                                                
#define SCON1_PERR__BMASK           0x40 ///< Parity Error Flag                                 
#define SCON1_PERR__SHIFT           0x06 ///< Parity Error Flag                                 
#define SCON1_PERR__NOT_SET         0x00 ///< Parity error has not occurred.                    
#define SCON1_PERR__SET             0x40 ///< Parity error has occurred.                        
                                                                                                
#define SCON1_OVR__BMASK            0x80 ///< Receive FIFO Overrun Flag                         
#define SCON1_OVR__SHIFT            0x07 ///< Receive FIFO Overrun Flag                         
#define SCON1_OVR__NOT_SET          0x00 ///< Receive FIFO overrun has not occurred.            
#define SCON1_OVR__SET              0x80 ///< Receive FIFO overrun has occurred.                
                                                                                                
//------------------------------------------------------------------------------
// SMOD1 Enums (UART1 Mode @ 0xE5)
//------------------------------------------------------------------------------
#define SMOD1_SBL__BMASK          0x01 ///< Stop Bit Length                                 
#define SMOD1_SBL__SHIFT          0x00 ///< Stop Bit Length                                 
#define SMOD1_SBL__SHORT          0x00 ///< Short: Stop bit is active for one bit time.     
#define SMOD1_SBL__LONG           0x01 ///< Long: Stop bit is active for two bit times (data
                                       ///< length = 6, 7, or 8 bits) or 1.5 bit times (data
                                       ///< length = 5 bits).                               
                                                                                            
#define SMOD1_XBE__BMASK          0x02 ///< Extra Bit Enable                                
#define SMOD1_XBE__SHIFT          0x01 ///< Extra Bit Enable                                
#define SMOD1_XBE__DISABLED       0x00 ///< Disable the extra bit.                          
#define SMOD1_XBE__ENABLED        0x02 ///< Enable the extra bit.                           
                                                                                            
#define SMOD1_SDL__FMASK          0x0C ///< Data Length                                     
#define SMOD1_SDL__SHIFT          0x02 ///< Data Length                                     
#define SMOD1_SDL__5_BITS         0x00 ///< 5 bits.                                         
#define SMOD1_SDL__6_BITS         0x04 ///< 6 bits.                                         
#define SMOD1_SDL__7_BITS         0x08 ///< 7 bits.                                         
#define SMOD1_SDL__8_BITS         0x0C ///< 8 bits.                                         
                                                                                            
#define SMOD1_PE__BMASK           0x10 ///< Parity Enable                                   
#define SMOD1_PE__SHIFT           0x04 ///< Parity Enable                                   
#define SMOD1_PE__PARITY_DISABLED 0x00 ///< Disable hardware parity.                        
#define SMOD1_PE__PARITY_ENABLED  0x10 ///< Enable hardware parity.                         
                                                                                            
#define SMOD1_SPT__FMASK          0x60 ///< Parity Type                                     
#define SMOD1_SPT__SHIFT          0x05 ///< Parity Type                                     
#define SMOD1_SPT__ODD_PARTY      0x00 ///< Odd.                                            
#define SMOD1_SPT__EVEN_PARITY    0x20 ///< Even.                                           
#define SMOD1_SPT__MARK_PARITY    0x40 ///< Mark.                                           
#define SMOD1_SPT__SPACE_PARITY   0x60 ///< Space.                                          
                                                                                            
#define SMOD1_MCE__BMASK          0x80 ///< Multiprocessor Communication Enable             
#define SMOD1_MCE__SHIFT          0x07 ///< Multiprocessor Communication Enable             
#define SMOD1_MCE__MULTI_DISABLED 0x00 ///< RI will be activated if the stop bits are 1.    
#define SMOD1_MCE__MULTI_ENABLED  0x80 ///< RI will be activated if the stop bits and extra 
                                       ///< bit are 1. The extra bit must be enabled using  
                                       ///< XBE.                                            
                                                                                            
//------------------------------------------------------------------------------
// CLKREC Enums (USB0 Clock Recovery Control @ 0x0F)
//------------------------------------------------------------------------------
#define CLKREC_CRLOW__BMASK      0x20 ///< Low Speed Clock Recovery Mode               
#define CLKREC_CRLOW__SHIFT      0x05 ///< Low Speed Clock Recovery Mode               
#define CLKREC_CRLOW__FULL_SPEED 0x00 ///< Full Speed Mode.                            
#define CLKREC_CRLOW__LOW_SPEED  0x20 ///< Low Speed Mode.                             
                                                                                       
#define CLKREC_CRSSEN__BMASK     0x40 ///< Clock Recovery Single Step                  
#define CLKREC_CRSSEN__SHIFT     0x06 ///< Clock Recovery Single Step                  
#define CLKREC_CRSSEN__DISABLED  0x00 ///< Disable single-step mode (normal calibration
                                      ///< mode).                                      
#define CLKREC_CRSSEN__ENABLED   0x40 ///< Enable single-step mode.                    
                                                                                       
#define CLKREC_CRE__BMASK        0x80 ///< Clock Recovery Enable                       
#define CLKREC_CRE__SHIFT        0x07 ///< Clock Recovery Enable                       
#define CLKREC_CRE__DISABLED     0x00 ///< Disable clock recovery.                     
#define CLKREC_CRE__ENABLED      0x80 ///< Enable clock recovery.                      
                                                                                       
//------------------------------------------------------------------------------
// CMIE Enums (USB0 Common Interrupt Enable @ 0x0B)
//------------------------------------------------------------------------------
#define CMIE_SUSINTE__BMASK    0x01 ///< Suspend Interrupt Enable       
#define CMIE_SUSINTE__SHIFT    0x00 ///< Suspend Interrupt Enable       
#define CMIE_SUSINTE__DISABLED 0x00 ///< Disable suspend interrupts.    
#define CMIE_SUSINTE__ENABLED  0x01 ///< Enable suspend interrupts.     
                                                                        
#define CMIE_RSUINTE__BMASK    0x02 ///< Resume Interrupt Enable        
#define CMIE_RSUINTE__SHIFT    0x01 ///< Resume Interrupt Enable        
#define CMIE_RSUINTE__DISABLED 0x00 ///< Disable resume interrupts.     
#define CMIE_RSUINTE__ENABLED  0x02 ///< Enable resume interrupts.      
                                                                        
#define CMIE_RSTINTE__BMASK    0x04 ///< Reset Interrupt Enable         
#define CMIE_RSTINTE__SHIFT    0x02 ///< Reset Interrupt Enable         
#define CMIE_RSTINTE__DISABLED 0x00 ///< Disable reset interrupts.      
#define CMIE_RSTINTE__ENABLED  0x04 ///< Enable reset interrupts.       
                                                                        
